ShortMesh/Laminar/2D_laminar_shortDV_results4/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleInternalEnergy;
}

mixture
{
    specie
    {
        molWeight   18.01528; // Molecular weight of H2O (kg/mol)
    }
    thermodynamics
    {
        Cp          4186;     // Specific heat capacity of H2O (J/kg-K)
        Hf          -285820;  // Standard enthalpy of formation of H2O (J/mol)
    }
    transport
    {
        mu          0.001002; // Dynamic viscosity of H2O (kg/(m-s))
        Pr          6.904;      // Prandtl number of H2O
    }
}


// ************************************************************************* //
